#ifndef __KEY_H__
#define __KEY_H__
#include "STC12C5A60S2.H"


/*****************************************************************************
相关按键设置
*****************************************************************************/
#define KEY_IO P0

//判断按键是否被按下的宏定义
#define _BTN_DOWN(x) ((x)==0)

/*****************************************************************************
Copyright: 2016 THB
File name: key.c
Description: 读卡器系统的初始化函数
Author: THB
Version: 1.0
Date: 2016/4/27
History: 2016/4/27 
*****************************************************************************/

unsigned char keyscan();


#endif